BEGIN;

    INSERT INTO users
        (user_name, password, role)
    VALUES('admin', '$2a$05$WRLE5TPY4ppszWklRiX0m.kjyX8uMtZ76O9lt8y8zXilM.vl/5hjS', 'admin');

INSERT INTO products ( imagePath,title,price,useMethod, content) VALUES
  ('https://raw.githubusercontent.com/naremanhilles/employment-website/master/client/src/assets/img/prod1.jpg','زيت الإنبات من فولاج',250,'طريقة الاستعمال:
تُرج الزجاجة جيداً قبل الإستعمال ٬ ثم يوضع الزيت بكمية مناسبة على فروة الرأس وتدلك فروة الرأس جيداً ٬ وبعد وصول الزيت إلى فروة الرأس يُغطى الشعر بالشاور كاب الخاص بزيت فولاج لمدة ٥ ساعات على الاقل ٬ ثم غسله بماء عادي ويفضل استخدام الماء الصحي في آخر غسلة للشعر ٬ وبعد تجفيفه يمشط الشعر بمشط فولاج الخشبي مع مراعاة استخدام شامبو مناسب أو التقليل من استخدام الشامبو للحصول على نتيجة أفضل للزيت . للحصول على نتيجة أفضل يستخدم الزيت ٣ مرات اسبوعياً .
فولاج إنبات الشعر : يُكثف الشعر – يملأ الفراغات – يُقوي الشعر يُسرع نمو الشعر – يُعزز نمو الشارب والذقن
مناسب للرجال والنساء والأطفال –  للاستعمال الخارجي فقط
ماركة مسجلة رقم : 1435008058
ترخـيـص صنـاعـي رقـــــــم','المكونات:  زيت جوزالهند – حلبة – بذور الحنة – مستخلصات ورقية – نباتات عطرية'),

   ('https://raw.githubusercontent.com/naremanhilles/employment-website/master/client/src/assets/img/prod2.jpg', 'زيت الصحة من فولاج',150, 'طريقة الاستعمال:
تُرج الزجاجة جيداً قبل الإستعمال ٬ ثم يوضع الزيت بكمية مناسبة على فروة الرأس وتدلك فروة الرأس جيداً ٬ وبعد وصول الزيت إلى فروة الرأس يُغطى الشعر بالشاور كاب الخاص بزيت فولاج لمدة ٥ ساعات على الاقل ٬ ثم غسله بماء عادي ويفضل استخدام الماء الصحي في آخر غسلة للشعر ٬ وبعد تجفيفه يمشط الشعر بمشط فولاج الخشبي  .مع مراعاة استخدام شامبو مناسب أو التقليل من استخدام الشامبو للحصول على نتيجة أفضل للزيت۔ للحصول على نتيجة أفضل يستخدم الزيت ٣ مرات اسبوعياً .
فولاج صحة الشعر : للتنعيم والتطويل – ومنع التساقط والتقصف ٬ فك التشابك – ازالة القشرة
مناسب للرجال والنساء والأطفال  – للاستعمال الخارجي فقط – يحفظ في مكان بارد وجاف
ترخـيـص صنـاعـي رقـــــــم
1435008058
حاصل على بـــراءة اختراع المانية برقم
DE202018102185','المكونات : زيت جوزالهند – حلبـة –  مستخلـصـات ورقـيـة  نباتات عطرية'),
  ('https://raw.githubusercontent.com/naremanhilles/employment-website/master/client/src/assets/img/prod3.jpg', 'زيت التنقية من فولاج',150, 'طريقة الاستعمال:
تُرج الزجاجة جيداً قبل الإستعمال ٬ ثم يوضع الزيت بكمية مناسبة على فروة الرأس وتدلك فروة الرأس جيداً ٬ وبعد وصول الزيت إلى فروة الرأس يُغطى الشعر بالشاور كاب الخاص بزيت فولاج لمدة ٥ ساعات على الاقل ٬ ثم غسله بماء عادي ويفضل استخدام الماء الصحي في آخر غسلة للشعر ٬ وبعد تجفيفه يمشط الشعر بمشط فولاج الخشبي۔ مع مراعاة استخدام شامبو مناسب أو التقليل من استخدام الشامبو للحصول على نتيجة أفضل للزيت .للحصول على نتيجة أفضل يستخدم الزيت ٢ مرات اسبوعياً  .يفضل استخدام زيت الصحة أو زيت الإنبات بعد الإنتهاء من القمل للحصول على نتيجة أفضل للشعر
فولاج منقي الشعر
يُنظف الشعر من القمل والصيبان – مقاوم للحكة و منظف للفروة – يُعطي للشعر نعومة ولمعان .
مناسب للرجال والنساء والأطفال –  للاستعمال الخارجي فقط –
يحفظ في مكان بارد وجاف
ماركة مسجلة رقم : 1435008058
حاصل على بـــراءة اختراع المانية برقم
DE202018102183','المكونات:  زيت جوزالهند – حلبة – حبة البركة –  مستخلصات ورقية – نباتات عطرية'),
  ('https://raw.githubusercontent.com/naremanhilles/employment-website/master/client/src/assets/img/prod4.jpg','زيت الشيب من فولاج', 350, 'طريقة الاستعمال : 
تُرج الزجاجة جيداً قبل الإستعمال ٬ ثم يوضع الزيت بكمية مناسبة على فروة الرأس وتدلك فروة الرأس جيداً ٬ وبعد وصول الزيت إلى فروة الرأس يُغطى الشعر بالشاور كاب الخاص بزيت فولاج لمدة ٥ ساعات على الاقل ٬ ثم غسله بماء عادي ويفضل استخدام الماء الصحي في آخر غسلة للشعر ٬ وبعد تجفيفه يمشط الشعر بمشط فولاج الخشبي  . مع مراعاة استخدام شامبو مناسب أو التقليل من استخدام الشامبو للحصول على نتيجة أفضل للزيت .للحصول على نتيجة أفضل يستخدم الزيت ٣ مرات اسبوعياً .ويفضل استخدام زيت الإنبات أو زيت الصحة حسب احتياج الشعر بعد زيت الشيب للحصول على نتيجة أفضل للشعر
فولاج لشيب الشعر : يساعد على عودة اللون الطبيعي للشعر – يُعزز افراز صبغة الميلانين – يُضفي البريق واللمعان – كما انه يقاوم الشعر الأبيض
مناسب للرجال والنساء والأطفال – للاستعمال الخارجي فقط –  يحفظ في مكان بارد وجاف
ماركة مسجلة رقم : 1435008058
حاصل على بـــراءة اختراع المانية برقم
DE202018102184','المكونات: زيت جوزالهند – حلبة – أوراق الكاري مستخلصات ورقية – نباتات عطرية'),
  ('https://raw.githubusercontent.com/naremanhilles/employment-website/master/client/src/assets/img/prod5.jpg', 'مشط فولاج من قرون الثور',20, 'طريقة الاستعمال :

تُرج الزجاجة جيداً قبل الإستعمال ٬ ثم يوضع الزيت بكمية مناسبة على فروة الرأس وتدلك فروة الرأس جيداً ٬ وبعد وصول الزيت إلى فروة الرأس يُغطى الشعر بالشاور كاب الخاص بزيت فولاج لمدة ٥ ساعات على الاقل ٬ ثم غسله بماء عادي ويفضل استخدام الماء الصحي في آخر غسلة للشعر ٬ وبعد تجفيفه يمشط الشعر بمشط فولاج الخشبي  .

 مع مراعاة استخدام شامبو مناسب أو التقليل من استخدام الشامبو للحصول على نتيجة أفضل للزيت .

للحصول على نتيجة أفضل يستخدم الزيت ٣ مرات اسبوعياً .','مشط فولاج ( المصنوع من قرون البقر )'),
  ('https://raw.githubusercontent.com/naremanhilles/employment-website/master/client/src/assets/img/prod6.jpg','غطاء الرأس من فولاج',20, 'الوصف:غالبية الأطفال الصغار يخافون من الإستحمام بسبب دخول الشامبو أو الصابون في أعينهم مما يسبب لهم ألما مزعجا والجميع يلجأ لشراء أنواع غالية من الشامبو لا تؤثر على العينين لحل هذه المشكلة، الأن لا حاجة لذلك نقدم لكم غطاء للرأس مصنوع من السيليكون عالي الجودة ويتميز بتصميم فريد يسمح لكم بغسيل شعر الطفل بسهولة ويمنع وصول الشامبو أو الصابون لأعين الطفل ويقوم أيضا بمنع دخول الماء لإذني الطفل','شاور كاب (غطاء الرأس) من فولاج مصنوعة من مواد مضادة للماء مع شريط مرن مريح لحماية الشعر أثناء الاستحمام أو وضع الزيت.
"يستخدم أكثر من مرة .. مناسب لكل الأعمار');


    -- for TUser 
    INSERT INTO TUser
        (s_name, s_mobile_number, b_status, s_address, s_image)
    VALUES
     ('دينا معين حجي','+9705588888888',true,'غزة','test.png'),
     ('جملات عبدالرحمن شملخ','+97078888877888',true,'شيخ رضوان','test.png'),
     ('كنعان جمال حسونة','+9747778888',true,'غزة','test.png'),
     ('أحمد محمد العلمي','+974745778888',true,'خانيونس','test.png'),
     ('خضر احمد مرتجى','+97474577778888',true,'نصر','test.png');
    
    INSERT INTO orders
        ( product_name, i_status,o_price,pay)
    VALUES
        ( '1', 2,300,'عند الإستلام'),
        ( '2', 2,300,'عند الإستلام'),
        ('3', 2,300,'إلكتروني'),
        ('2', 2,300,'إلكتروني'),
        ('4',  2,300,'إلكتروني'),
        ('1', 2,300,'إلكتروني');


    INSERT INTO TUser_order
        (tuser_id, order_id)
    VALUES
     (1,1), 
     (2,2), 
     (3,3), 
     (4,4),   
     (5,5), 
     (1,6);
    COMMIT;